#include <stdio.h>
#include <string.h>
#include <stdlib.h>

int main(void){

    char password[20];

    printf("Insert key to the true treasure: (type your key) ");
    scanf("%s", &password);

    if (strcmp(password, "bashtes_pwd") == 0){
        system("lolcat -ad /home/heroes/.payload");
        //printf("\n✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧\n _____ ____  ___ _____ _   _ ____  ____  _   _ ___ ____  \n|  ___|  _ \|_ _| ____| \ | |  _ \/ ___|| | | |_ _|  _ \ \n| |_  | |_) || ||  _| |  \| | | | \___ \| |_| || || |_) |\n|  _| |  _ < | || |___| |\  | |_| |___) |  _  || ||  __/ \n|_|   |_| \_\___|_____|_| \_|____/|____/|_| |_|___|_|\n✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧");
        //system("echo -e \"\n✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧\n _____ ____  ___ _____ _   _ ____  ____  _   _ ___ ____  \n|  ___|  _ \|_ _| ____| \ | |  _ \/ ___|| | | |_ _|  _ \ \n| |_  | |_) || ||  _| |  \| | | | \___ \| |_| || || |_) |\n|  _| |  _ < | || |___| |\  | |_| |___) |  _  || ||  __/ \n|_|   |_| \_\___|_____|_| \_|____/|____/|_| |_|___|_|\n✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *✧･ﾟ:*✧･ﾟ: *:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧*:･ﾟ✧\" | lolcat -ad");
    } else {
        printf("\n Sadly, that's not the right key.");
    }

    exit(EXIT_SUCCESS);
}